Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Важно: Для работы узла требуется предварительно создать подключение к базе данных и связать его с входным портом Подключение.
en: Important: For the node operation, it is required to pre-create connection to database and connect it with the Connection input port.

source: Важно: Для того, чтобы при способе слияния Полное соединение использовать FULL JOIN соединение, необходимо в мастере настройки сопоставить ключевые поля соединяемых наборов.
en: Important: To use FULL JOIN when selecting Full join method of join, it is required to map the key fields of the joined data sets in the wizard.

source: Важно: Доменная авторизация осуществляется от имени пользователя, под которым запущен сервер Loginom.
en: Important: The domain authorization process is implemented as user under whose name the Loginom server has been started.

source: Важно: Если используется серверный (Server) вариант Loginom, то путь к базе данных должен иметь вид "<root>datadatabases1C", где <root> — корневая папка Loginom.
en: Important: If the server Loginom version is used, the following path to the database must be used: "<root>datadatabases1C" where <root> is a root Loginom folder.

source: Важно: Если узел заблокирован (узел выполняется или открыт мастер настройки узла), то его свойства посмотреть нельзя.
en: Important: If the node is locked (node execution is in progress or node configuration wizard is opened), it is not possible to view its properties.

source: Важно: Имеются особенности при изменении типа поля со "Строкового" на "Логический": в общем случае из текущей локали выделяются строки, которые преобразуются в логический тип данных.
en: Important: There are peculiarities observed when changing the field type from the "String" to the "Logical" one: in the general case, the strings that are transformed to the logical data type are selected from the current locale.

source: Важно: Имя должно быть уникальным, начинаться с заглавной или строчной латинской буквы или с символа подчеркивания.
en: Important: The name must be unique. It must start from the capital or lower case Latin letter or from the underscore character.

source: Важно: Компонент будет выдавать ошибку при выходе со страницы настройки или при выполнении, если у него нет ни одного выбранного узла.
en: Important: The component will throw an error message when leaving the configuration page or when executing if it doesn't have selected nodes.

source: Важно: Неперехваченные ошибки в Promise записываются в лог сервера, при этом узел выполняется без сообщений об ошибке.
en: Important: Uncaught errors in Promise are recorded in the server log, and the node is executed without error messages.

source: Важно: Нижеперечисленные показатели недоступны для полей Переменного типа.
en: Important: The indicators listed below are not available for the fields of the Variant type.

source: Важно: При превышении максимального значения длины экспортируемой строки возникнет ошибка экспорта.
en: Important: When exceeding the maximum value of the exported string length, the export error will occur.

source: Важно: Расчет значений выражений осуществляется в том порядке, в котором они следуют в списке выражений, т.е. сначала вычисляются выражения, находящиеся выше в списке.
en: Important: Values of the expressions are calculated in the order in which they are stated in the expressions list, namely, the expressions that are higher in the list are calculated first.

source: Важно: Узел не накладывает ограничений при изменении типа данных поля.
en: Important: The node does not impose restrictions when changing the field data type.

source: Важно: в аналитической платформе Loginom, на текущий момент, возможно лишь импортировать данные из Хранилища данных Deductor Warehouse.
en: Important: Currently, the Loginom analytical platform enables to import data only from the Deductor Warehouse data warehouse.

source: Важно: в настройках устанавливается время выполнения узла, а не программы, поэтому если галочка Завершить программу по тайм-ауту не установлена, то через определенное тайм-аутом время узел перестанет выполняться, а программа — нет.
en: Important: The time of node execution is set in the settings (not the time of the program execution) that is why if checkbox is not selected for Terminate program by timeout, the node execution will be terminated upon expiration of some time period set by the timeout, whereas the program execution will not be terminated.

source: Важно: в случае замены числовых данных стоит учитывать интервалы, в которые попадет то или иное заменяемое значение.
en: Important: In the case of replacement of the numeric data, it is required to consider the intervals into which this or that replaced value is included.

source: Важно: в случае попытки одновременного применения значений полей Нижняя граница диапазонов открыта и Верхняя граница диапазонов открыта таблицы Внешние диапазоны и, соответственно, флагов Нижняя граница открыта, Верхняя граница открыта мастера настройки приоритет отдаётся полям, т.е. в данной ситуации флаги не повлияют на результат.
en: Important: While attempting to use the values of Lower bin bound open and Upper bin bound open fields of External ranges table simultaneously, and, correspondingly, Lower bound open, Upper bound open checkboxes of the wizard, the priority is given to the fields, namely, in this case, checkboxes will have no influence on the result.

source: Важно: вещественные числа записываются с использованием десятичной точки, например, 2.71.
en: Important: Real numbers are recorded using the decimal point, for example,2.71.

source: Важно: все незарезервированные параметры в строке запуска интерпретируются как параметры установки значений переменных.
en: Important: All nonreserved parameters in the start string are interpreted as the setup parameters of the variables values.

source: Важно: входные данные никогда не должны содержать пропусков, выходные данные не должны содержать пропусков во время обучения.
en: Important: Input data must never contain missing values, output data must not contain missing values during training.

source: Важно: выходной порт для переменных может иметь линию связи только с входным портом для переменных.
en: Important: The outpot port for variables can have a connection line only with the input port for variables.

source: Важно: для работы узла требуется предварительно создать подключение к базе данных и связать его с входным портом Подключение.
en: Important: For the node operation, it is required to pre-create connection to database and connect it with the Connection input port.

source: Важно: допустимо сопоставление полей/переменных только совместимых типов данных.
en: Important: It is allowed to map the fields/variables only of the compatible data types.

source: Важно: если выражение вычисляемого факта некорректное, то все его ячейки состоят из пропусков.
en: Important: If the calculated measure expression is incorrect, all its cells consist of missing values.

source: Важно: по умолчанию для портов, принимающих табличные данные, опция "Автоматическая синхронизация включена".
en: Important: By default for the ports that receive the table data, "Automapping enabled" option is used.

source: Важно: по умолчанию при создании нового узла в его портах включена опция Автоматическая синхронизация полей.
en: Important: When creating the new node, Automapping of Fields option is enabled by default in its ports.

source: Важно: порты используются не только для передачи данных, но и для синхронизации.
en: Important: The ports are used not only for data transfer but also for synchronization.

source: Важно: после обновления следует проверить работоспособность вызывающих переопубликованный веб-сервис узлов сценария и, при необходимости, перенастроить их.
en: Important: After the update, it is required to check operation of the workflow nodes that call the republished web service, and then it is recommended to reconfigure them when applicable.

source: Важно: при использовании автосинхронизации полей возможны ситуации, когда поля/переменные в портах определены механизмом автосинхронизации из структуры данных, подаваемых в порт.
en: Important: When Automapping of fields is used, there might be situations in which the fields/variables in ports are defined by the automapping mechanism based on structure of the data supplied to the port.

source: Важно: программа не поддерживает автосохранений, при закрытии окна программы (вкладки браузера) все изменения будут утеряны.
en: Important: The software doesn't auto save. When closing the software window (browser tabs), all changes will be lost.

source: Важно: скрипт необходимо завершать командой return, которая выводит результат в вычисляемое поле калькулятора.
en: Important: The script must be finished by return command that shows the result in the calculated calculator field.

source: Важно: следует учитывать, что Loginom использует формат хранения данных в LGD-файлах отличный от использовавшегося ранее DDF-формата.
en: Important: It is required to take into account that the format of data storage in the LGD files used in Loginom differs from the DDF format used earlier.

source: Важно: чтобы избежать конфликта имён, необходимо обеспечить уникальность пары значений: имя публикуемого узла , пространство имён публикуемого пакета.
en: Important: To avoid the name conflict, it is required to provide uniqueness of the paired values: published node name, published package namespace.

source: Важно: этот компонент небезопасный, так как предоставляет доступ к программам и файловой системе.
en: Important: This component is not safe as it provides access to programs and file system.

source: Важно: Для интеграции с некоторыми источниками, например, базами данных и веб-сервисами, необходима предварительная настройка подключения.
en: Important: To provide integration with several sources, for example, databases and web services, it is required to preset connection.

source: Важно: В некоторых случаях применение параллельной обработки недопустимо.
en: Important: In some cases parallel processing is not allowed.

source: Важно: При выполнении Узла-ссылки выполняется узел, являющийся источником ссылки.
en: Important: When executing the Reference node, the node that is the reference source is executed.

source: Важно: При любом соединении (JOIN) в результирующий набор данных включаются ключевые поля только главной таблицы.
en: Important: Only the key fields of the main table can be included into the resulting data set for any join (JOIN).

source: Важно: Узлы из внешних пакетов, других сценариев и подмоделей отобразятся в дереве только в том случае, если доступ к ним разрешен их модификатором доступа.
en: Important: The nodes from the external packages, other workflows and supernodes will be displayed in the tree only on condition of access granted to them by their access modifier.

source: Важно: для получения прогнозируемых данных требуется предварительное обучение узла.
en: Important: To get the forecast data, it is required to train the node beforehand.

source: Важно: для работы узла требуется предварительно создать подключение к XSD-схеме и связать его с входным портом Подключение к источнику XSD-схемы.
en: Important: For the node operation, it is required to pre-create connection to the XSD schema and connect it with Connect to XSD schema source input port.

source: Важно: использование кэша для передачи значений между вызовами require может привести к непредсказуемым результатам вычислений в виду использования многопоточности вычислений.
en: Important: The cache usage when transferring values between require calls can cause unpredictable results of calculations due to the usage of calculation multithreading.

source: Важно: порты можно соединять только одного типа, то есть порт "Таблица" может быть соединен только с одноименным портом.
en: Important: It is allowed to connect only the ports of the same type. Namely, the "Table" port can be connected only with the одноименным портом.

source: Валидация моделей
en: Validation of models

source: Валидация — проверка правильности работы (предсказательной способности) аналитической модели, построенной на основе машинного обучения, а также удостоверение, что она соответствует требованиям решаемой задачи.
en: Validation is a check of the operation correctness (predictive ability) of the analytical model trained on the machine learning basis. It also secures compliance of the analytical model with the requirements of the solved task.

source: Вариант отображения диаграммы.
en: Chart display option.

source: Варимакс — критерием является упрощение описания каждого фактора.
en: Varimax: criterion is simplification of description of each factor.

source: Вверх Вверх — производит переход к объекту верхнего уровня.
en: Go up Go up: transition to the upper level object.

source: Ввод вручную — используется внутренняя таблица замен;
en: Manual input: the internal replacement table is used.

source: Веб-сервисы
en: Web services

source: Веб-сервисы — данный раздел описывает работу Loginom с веб-сервисами.
en: Web services. This section describes Loginom and web services operation.

source: Вероятность принадлежности — для каждого объекта проставляется вероятность принадлежности к данному кластеру.
en: Ownership probability: it is required to specify probability of ownership by this cluster for each object.

source: Версия Loginom
en: Loginom version

source: Версия платформы — версия платформы 1С:Предприятие, к которой настраивается подключение.
en: Platform version: version of the 1C:Enterprise platform for which the connection is set.

source: Версия — версия открытого Пакета, настраивается в его Свойствах.
en: Version: version of the opened Package. It is configured in its Properties.

source: Версия — позволяет указать версию Пакета.
en: Version enables to specify the Package version.

source: Верхняя граница 95% ДИ — верхняя граница 95%-го доверительного интервала.
en: Upper bound 95% CI: the upper bound of 95% confidence interval.

source: Верхняя часть панели — содержит сравнительную гистограмму кластеров, в одной области совмещены гистограммы кластеров и генеральной совокупности.
en: Upper panel part contains the comparative cluster histogram. The cluster histograms and universal set are combined in one area.

source: Верхняя — верхняя граница интервала;
en: Upper — upper bin bound;

source: Весь лист — область листа, содержащего данные для импорта, определяется автоматически.
en: Whole sheet: area of the sheet containing data for import is automatically defined.

source: Весь набор данных (используется по умолчанию) — все записи входной таблицы войдут в результирующий XML.
en: The whole data set (it is used by default): all records of the input table will be included into the resulting XML.

source: Вещественное число — для ввода вещественного числа, будет вставлено 0.0;
en: Real number: 0.0 will be inserted to enter the real number.

source: Вещественный -2 Log Likelihood
en: Real -2 Log Likelihood

source: Вещественный Значимость
en: Real Significance

source: Вещественный Хи-квадрат
en: Real Chi-square

source: Вещественный AIC
en: Real AIC

source: Вещественный AICc
en: Real AICc

source: Вещественный BIC
en: Real BIC

source: Вещественный HQC
en: Real HQC

source: Вещественный R2
en: Real R2

source: Вещественный R2 корр.
en: Real R2 adj.

source: Вид данных (непрерывный, дискретный)
en: Data kind (continuous, discrete)

source: Вид данных — вид данных, задается списком значений:
en: Data kind — data kind: it is set by a list of values:

source: Вид данных — тип данных полей выходного набора порта.
en: Data kind: data type of the fields of the output data set of the port.

source: Вид данных — один из возможных видов данных .
en: Data kind: one of the possible data kinds.

source: Вид данных — один из возможных видов данных.
en: Data kind: one of the possible data kinds.

source: Вид диаграммы — позволяет выбрать вид отображаемой диаграммы:
en: Chart type enables to select the type of the displayed chart:

source: Вид цикла — определение логики работы цикла, задается радиокнопкой:
en: Loop type: determination of the loop operation logics. It is set using the radio button:

source: Визуализатор Статистика
en: Statistics Visualizer

source: Визуализация
en: Visualisation

source: Винсоризация — если встречается значение вне заданного диапазона, то оно приводится к максимальному/минимальному значению.
en: Winsorization: if the value that goes out of the given range is detected, it is reduced to the maximum/minimum value.

source: Включить в модель константу — добавляет в модель зависимую переменную.
en: Include intercept into the model adds the dependent variable to the model.

source: Включить константу в модель — значение логического типа.
en: Include intercept into the model: the boolean value.

source: Включить расчет сезонности — установка данного флага позволяет задать параметры для сезонной составляющей:
en: Enable seasonality calculation: selection of this checkbox enables to set parameters for the seasonal component:

source: Включить резервный источник WSDL — при выставлении флажка в чекбоксе делает активным Резервный источник WDSL.
en: Enable reserve WSDL source: when selecting this checkbox, Reserve WSDL source is enabled.

source: Внешние диапазоны.
en: External ranges.

source: Внешние диапазоны
en: External ranges

source: Внешние модули
en: External modules

source: Внимание: по умолчанию в системе задан пользователь admin с правами Администратор и паролем: admin.
en: Attention: admin user with the Administrator rights and a password (admin) is set in the system by default.

source: Внутреннее соединение
en: Inner join

source: Внутреннее соединение Внутреннее соединение
en: Inner Join Inner Join

source: Вперед Вперед — отменяет переход Назад, если после него не было произведено никаких других действий навигации.
en: Go forward Go forward enables to cancel Go back transition if no other navigation operations have been performed afterwards.

source: Временная зона по умолчанию — значения с типом Дата/Время преобразуются при извлечении из XML по следующему алгоритму:
en: Default time zone: the Date/Time type values are transformed when extracting from XML according to the following algorithm:

source: Временная зона по умолчанию — значения с типом Дата/Время преобразуются при обработке ответа сервера по следующему алгоритму:
en: Default time zone: the Date/Time type values are transformed when processing the server response according to the following algorithm:

source: Время автоподбора не более (сек.) — максимальное время работы алгоритма (0 — отключение ограничения).
en: Autofit time not more (s): the maximum algorithm operation time (0 — restriction is disabled).

source: Время жизни на время транзакции при неактивности — сервер MySQL не контролирует некорректно разорванные подключения.
en: Idle-in-transaction timeout: MySQL server does not control incorrectly disrupted connections.

source: Время.
en: Time.

source: Время — для ввода времени, будет вставлено StrToDate("__:__:__", "HH:NN:SS").
en: Time: StrToDate("__:__:__", "HH:NN:SS") will be inserted to enter the time.

source: Время — для ввода даты/времени, будет вставлена конструкция создания объекта, содержащего текущее дата/время.
en: Time: to enter the date/time, the object creation construction containing the current date/time will be inserted.

source: Вручную — выполняя специальную процедуру переобучения узла при настройке Сценария;
en: Manually: the special procedure of the node retraining is performed during the Workflow configuration.

source: Все ветви — активирует выполнение всех ветвей, в том числе ветвь Иначе;
en: All branches enable to activate execution of all branches, including Otherwise branch.

source: Все последнему — прибавляется к последнему разгруппированному значению.
en: All latest: it is required to add to the latest ungrouped value.

source: Всегда выполнять — узел всегда выполняется без переобучения;
en: Always execute: the node is always executed without retraining.

source: Всегда переобучать — узел всегда выполняется с переобучением;
en: Always retrain: the node is always executed with retraining.

source: Входное дерево данных Дерево данных.
en: Input data tree Data tree.

source: Входной источник данных Входной источник данных (таблица данных) — набор данных, подлежащий изменению;
en: Input data source Input data source (data table): the data set to be changed.

source: Входной источник данных Входной источник данных (таблица данных).
en: Input data source Input data source (data table).

source: Входной источник данных Входной источник данных — порт для подключения входного набора данных в виде таблицы.
en: Input data source Input data source: the port for connection of the input data set in the form of a table.

source: Входной источник данных Входной источник данных — порт для подключения входного набора данных.
en: Input data source Input data source: the port for connection of the input data set.

source: Входной источник данных Входной источник данных — таблица данных.
en: Input data source Input data source — data table.

source: Входной источник данных Таблица данных;
en: Input data source Data table

source: Входные наборы данных (InputTables, InputTable);
en: Input data sets (InputTables, InputTable);

source: Входные наборы
en: Input data set

source: Входные переменные
en: Input variables

source: Входные переменные (InputVariables);
en: Input variables (InputVariables);

source: Входные переменные Входные переменные — набор переменных;
en: Input variables Input variables: set of variables.

source: Входные переменные Входные переменные — необязательный набор переменных;
en: Input variables Input variables: the optional set of variables.

source: Входные переменные Входные переменные — переменные, подлежащие изменению.
en: Input variables Input variables: the variables to be changed.

source: Входные переменные Входные переменные — список переменных, которые можно использовать в обработчике.
en: Input variables Input variables: list of variables that can be used in the handler.

source: Входные переменные Входные переменные — список переменных, подлежащий преобразованию в таблицу.
en: Input variables Input variables: list of variables to be transformed to a table.

source: Входные переменные Переменные (необязательный порт);
en: Input variables Variables (optional port)

source: Входные — метки полей/переменных входного набора порта.
en: Input: captions of the fields/variables of the input data set of the port.

source: Входы Входы Новый порт — создать новый порт входа:
en: Inputs Inputs New port enable to create a new input port:

source: Выбор из выпадающего списка элемента <Не задано> — используется для совместимости с продуктами прошлого поколения (DIS, Deductor 5.3) при публикации подмодели в качестве веб-сервиса.
en: Select from the item drop-down menu <Unspecified>: it is used for compatibility with past generation products (DIS, Deductor 5.3) when publishing the supernode as a web service.

source: Выбор из выпадающего списка элемента <Уникальное> (используется по умолчанию) — имя порта не задается пользователем явно, при этом система генерирует внутреннее уникальное имя самостоятельно.
en: Select from the item drop-down menu<Unique> (it is used by default): the port name is not explicitly given by a user, in this case, the system generates the internal unique name independently.

source: Выбор объекта — предлагается выбрать один из вариантов выбора объекта Excel, содержащего импортируемые данные.
en: Object selection: it is requested to select one of the selection options of the Excel object containing the imported data.
